// Напишите программу, которая принимает на вход два числа и проверяет, является ли одно число квадратом другого.
/*
void Quadrat ( int num1, int num2 )
{
    if ( num1 * num1 == num2 )
    {
        Console.WriteLine ( $"число {num2} является квадратом числа {num1}" );
    }
    if ( num2 * num2 == num1 )
    {
        Console.WriteLine ( $"Число {num1} является квадратом числа {num2}" );
    }
    else
    {
        Console.WriteLine ( $"Ни одно из чисел не является квадратом другого числа" );
    }
    
}

Console.WriteLine("Введите первое число: ");
int Num1 = Convert.ToInt32(Console.ReadLine());
Console.WriteLine("Введите второе число: ");
int Num2 = Convert.ToInt32(Console.ReadLine());

Quadrat(Num1, Num2);
*/

