// Напишите программу, которая принимает на вход число и проверяет, кратно ли оно одновременно a и b.
/*
void Kratnost(int Nummer, int a, int b)
{
    
    if(Nummer % a == 0 && Nummer % b == 0)
    {
        Console.WriteLine($"Число {Nummer} кратно {a} и {b}");
    }
    else
    {
        Console.WriteLine($"Число {Nummer} не кратно одновременно {a} и {b}");
    }
    
}

Console.WriteLine("Введите первое число: ");
int num = Convert.ToInt32(Console.ReadLine());
Console.WriteLine("Введите второе число: ");
int A = Convert.ToInt32(Console.ReadLine());
Console.WriteLine("Введите третье число: ");
int B = Convert.ToInt32(Console.ReadLine());

Kratnost(num, A, B);
*/
